java/concurrency.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>资源争用模型(泛多线程编程)</title>
<!-- 2017-10-11 周三 15:39 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="王月阳" />
<meta  name="description" content="讲解资源争用模型，如何解决资源争用过程中的资源安全问题。Java又是如何实现资源争用的。"
 />
<meta  name="keywords" content="Java concurrenty 多线程 资源争用 Java内存模型 AQS Java锁 MVCC" />
<link rel="stylesheet" type="text/css" href="./css/style.css" />
</head>
<body>
<div id="content">
<h1 class="title">资源争用模型(泛多线程编程)</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. 线程的演进</a>
<ul>
<li><a href="#sec-1-1">1.1. 从单道程序到多道程序，从多进程到多线程</a></li>
</ul>
</li>
<li><a href="#sec-2">2. 线程的生命周期</a>
<ul>
<li><a href="#sec-2-1">2.1. 线程状态</a></li>
<li><a href="#sec-2-2">2.2. 线程状态之间的转换</a></li>
</ul>
</li>
<li><a href="#sec-3">3. 多线程适用场景</a></li>
<li><a href="#sec-4">4. 资源争用模型</a>
<ul>
<li><a href="#sec-4-1">4.1. 资源争用模型的含义</a></li>
<li><a href="#sec-4-2">4.2. 例子</a></li>
<li><a href="#sec-4-3">4.3. 从争的角度解决问题（排队模型）</a>
<ul>
<li><a href="#sec-4-3-1">4.3.1. 排队的本质就是有序</a></li>
<li><a href="#sec-4-3-2">4.3.2. 排队的实现</a></li>
</ul>
</li>
<li><a href="#sec-4-4">4.4. 从资源的角度解决问题</a>
<ul>
<li><a href="#sec-4-4-1">4.4.1. 不共享资源 New</a></li>
<li><a href="#sec-4-4-2">4.4.2. 资源不可变 ImmutableData</a></li>
</ul>
</li>
<li><a href="#sec-4-5">4.5. 更细的粒度</a>
<ul>
<li><a href="#sec-4-5-1">4.5.1. 共享锁与排他锁</a></li>
<li><a href="#sec-4-5-2">4.5.2. MVCC</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-5">5. Java内存模型与资源争用</a>
<ul>
<li><a href="#sec-5-1">5.1. 分析被争用的资源</a>
<ul>
<li><a href="#sec-5-1-1">5.1.1. 账户金额问题</a></li>
</ul>
</li>
<li><a href="#sec-5-2">5.2. Java如何使用不共享内存模型解决线程安全问题</a>
<ul>
<li><a href="#sec-5-2-1">5.2.1. ThreadLocal</a></li>
</ul>
</li>
<li><a href="#sec-5-3">5.3. Java如果使用不可变资源模型解决线程安全问题</a>
<ul>
<li><a href="#sec-5-3-1">5.3.1. Final关键字</a></li>
</ul>
</li>
<li><a href="#sec-5-4">5.4. Java如何使用排队模型解决线程安全问题</a>
<ul>
<li><a href="#sec-5-4-1">5.4.1. synchronized的用法</a></li>
<li><a href="#sec-5-4-2">5.4.2. Java对象头</a></li>
<li><a href="#sec-5-4-3">5.4.3. AQS解读</a></li>
<li><a href="#sec-5-4-4">5.4.4. 读写分离</a></li>
<li><a href="#sec-5-4-5">5.4.5. CountDownLatch</a></li>
<li><a href="#sec-5-4-6">5.4.6. Semaphore</a></li>
<li><a href="#sec-5-4-7">5.4.7. FutureTask</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-6">6. Java线程管理</a>
<ul>
<li><a href="#sec-6-1">6.1. ThreadPoolExecutor解读</a>
<ul>
<li><a href="#sec-6-1-1">6.1.1. 参数说明</a></li>
<li><a href="#sec-6-1-2">6.1.2. 核心方法解读</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-7">7. 分布式系统中的资源争用</a></li>
<li><a href="#sec-8">8. 学习路线图</a></li>
</ul>
</div>
</div>


<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 线程的演进</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> 从单道程序到多道程序，从多进程到多线程</h3>
<div class="outline-text-3" id="text-1-1">
<p>
    计算机最开始的时候的运行模式是从存储器（存储器大概发展过程：纸带-磁带-软盘-光盘-机械硬盘-ssd）上读取程序，然后将二进
制命令输送到cpu执行。所以初期的单道程序就是读取一个程序，cpu执行；读取一个程序，cpu执行。相对来说，cpu的运算速度要比
IO速度快很多，当任务需要执行io的时候，cpu就会等待。所以cpu呈现出来的状态就是三天打渔两天晒网的状态。这对于cpu来说是一种浪费。为了解决这个问题，前辈们
想出来这样一个方法，一次将多个程序读入到内存中，当一个程序执行到io的时候，就会切换到另一个程序执行。有可能执行的程序不需
要执行io，这样就会等待当前程序执行完成再执行下一个程序。
</p>

<p>
    随着计算机的发展，操作系统开始出现，操作系统的主要功能是通过驱动管理不同的硬件，为用户的程序提供一致的接口。进程的出
现也为管理计算机资源提供了很好的模型。进程模型是对程序执行所需要的cpu，内存，文件，设备等资源一种整合抽象。因为操作系统
是以微内核+服务的形式提供功能的。所以就要区分进程是内核进程还是用户进程。内核进程要比用户进程有更全的功能，比如操作io，
设备，文件等。所以实际上，用户程序要发生io的时候，会通过系统调用将内核进程切换到cpu，使用内核进程完成io功能。系统调用是
通过一种基础的中断方式实现，具体的不深究。
</p>

<p>
    当一个用户进程发生io后，进程会等待io完成。这个时候如果还占用cpu就会导致cpu浪费，如同单道程序一样。所以这个时候应该将
等待io的进程切换出去，将另一个进程切换到cpu中继续执行。这就是进程切换。如前文所说的，进程持有文件，设备等一系列的资源。
在进程发生切换的时候，要将当前进程的这些资源切换到内存甚至切换到硬盘中；新的进程切换进来的时候，也要把对应的资源切换进内
存和cpu中，这需要几千甚至更多的cpu运算，这其实也是对cpu资源的一种浪费。
</p>

<p>
    怎么解决资源切换带来的cpu浪费呢？我们先看一下为啥要切换进程。因为cpu执行程序到io的时候，cpu被闲置了，所以要切换到其
他进程继续使用cpu，而这个场景中是没有涉及到资源的。所以，我们真正要实现的是切换程序对cpu的控制权，而不是资源的切换。那要
怎么办呢？如果把程序的执行单位和资源拥有者分离开，每次切换的时候只切换执行单位而不切换资源，这样会不会好很多。这也就是线
程出现的原因。我们在启动一个程序的时候，为这个进程分配资源，文件，设备和cpu，但cpu真正调度的却是线程。线程相对进程来说，
不会拥有那么多的资源，在线程切换的时候，只需要切换cpu现场和很少一部分的内存数据就可以完成了。这比切换线程要减少很多cpu开
销。
</p>

<p>
    一个线程只包含线程ID，当前指令指针（PC），寄存器集合和线程堆栈。这些数据比起进程来要小很多很多。所以切换起来比进程切
换方便很多。所以一台机器可以支撑几千几万的线程并发，却只能支撑几百的进程并发。
</p>

<p>
    从上述过程可以看出，cpu执行和调度的基本单位从程序演进到进程，又演进到线程。其目的都是为了弥补io和cpu计算之间的速度差
距，实现对cpu的有效利用。
</p>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 线程的生命周期</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> 线程状态</h3>
<div class="outline-text-3" id="text-2-1">
<p>
在jvm中的定义中，线程的状态一共有6中，分别是NEW,RUNNABLE,BLOCKED,WAITING,TIMED<sub>WAITING和TERMINATED。</sub>
</p>
<ul class="org-ul">
<li>NEW：线程创建还没有开始执行的状态。在执行start方法转到RUNNABLE状态。
</li>
<li>RUNNABLE：标明线程已经在JVM中执行，但可能等待操作系统为其分配资源，比如cpu，才能真正执行
</li>
<li>BLOCKED：标明线程处于阻塞状态，等待获取锁
</li>
<li>WAITING：标明线程处于等待状态，等待其他线程将其唤醒。BLOCKED和WAITING的区别是BLOCKED是被动阻塞，等待系统唤醒进入
RUNNABLE状态，而WAITING是线程主动进入等待状态，由用户线程负责唤醒。jvm为了管理方便才区分了这两种状态
</li>
<li>TIMED<sub>WAITING：带超时时间的等待状态</sub>
</li>
<li>TERMINATED：线程终止状态
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> 线程状态之间的转换</h3>
<div class="outline-text-3" id="text-2-2">
<p>
[NEW &#x2013;start()&#x2013;&gt; RUNNABLE
[RUNNABLE &#x2013;Thread.sleep()&#x2013;&gt; WAITING]<br  />
   [RUNNABLE &#x2013;Thread.sleep()&#x2013;&gt; WAITING]<br  />
   [RUNNABLE &#x2013;Thread.sleep(long)&#x2013;&gt; TIMED<sub>WAITING]<br  />
</sub>
[RUNNABLE &#x2013;Thread.sleep(long)&#x2013;&gt; TIMED<sub>WAITING]<br  />
</sub>
[RUNNABLE &#x2013;Thread.sleep(long)&#x2013;&gt; TIMED<sub>WAITING]<br  />
</sub>
[RUNNABLE &#x2013;synchronized&#x2013;&gt; BLOCKED]<br  />
   [RUNNABLE &#x2013;IO&#x2013;&gt; TIMED<sub>WAITING</sub>,WAITING,BLOCKED]<br  />
   [TIME<sub>WAITTING</sub>,WAITING,BLOCKED &#x2013;OVERTIME,interrupt(),IOSignal,HoldLock&#x2013;&gt; RUNNABLE]<br  />
   [RUNNABLE &#x2013;run()&#x2013;&gt; TERMINATED]
</p>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 多线程适用场景</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>通过在发生IO的时候切换到其他线程执行而充分利用cpu性能
</li>
<li>充分利用多核cpu性能，实现计算并行化
</li>
<li>简化业务模型，分离业务关注点
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> 资源争用模型</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> 资源争用模型的含义</h3>
<div class="outline-text-3" id="text-4-1">
<p>
资源争用，顾名思义就是不同的使用者对共享的资源进行原子性使用。下面我们从日常生活中举个例子来说明一下什么是资源争用。
</p>
</div>
</div>
<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> 例子</h3>
<div class="outline-text-3" id="text-4-2">
<p>
举个常见的高速路出口的例子。在这个例子中，不同的车辆就是不同的使用者，高速路出口就是共享的资源。当多辆车同时到达高速
路出口的时候，一个出口同一个时间点只能允许一辆车通行，这可怎么办呢？现实生活中是什么样的呢，所有车辆排队依次通过出口。
当车流量特别大的时候，排队的车辆就会很多，又怎么办，增开高速路出口，把车辆分散到不同的出口。所以在本例中，保证业务正
常进行的两个点分别是排队和增加资源，当然是基于操作是原子的前提下。
</p>

<p>
再举个饭店里顾客点菜厨师炒菜的例子，在这个例子中，厨师就是共享的资源，顾客就是资源争用者。那么正常生活中，是怎么保证
菜被正常的做出来的呢？客户A点了一个菜之后，厨师开始炒菜；然后另一个人B又点了10个菜，这10个菜都由服务员通知厨师炒了。然后厨师
就会按照服务员给的菜单的顺序一个一个炒菜。在本例中，我们默认了一个前提，就是炒菜是一个一个炒的，这是一个原子的操
作，不可分割。不然厨师把炒这个菜的盐放到了另一个菜的锅里，就这跪了。在本例中，我们还有一个大家习以为常的点，就是厨师
会自动的一个一个的炒菜，厨师会人工判断先炒那个菜后炒那个菜，这是不是就相当于给业务线程排了个队呢？除去排队，还有什么
方法能减少争用呢？套路来了，增加资源啊。。。
</p>

<p>
所以，在资源争用模型中，要么排队，要么加资源。
</p>
</div>
</div>
<div id="outline-container-sec-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> 从争的角度解决问题（排队模型）</h3>
<div class="outline-text-3" id="text-4-3">
</div><div id="outline-container-sec-4-3-1" class="outline-4">
<h4 id="sec-4-3-1"><span class="section-number-4">4.3.1</span> 排队的本质就是有序</h4>
<div class="outline-text-4" id="text-4-3-1">
<p>
从上一节的例子可以看出，解决争用一个常见的方式就是让操作有序。这个模型我们可以叫它排队模型。通过各种操作的排队，实现
操作有序，进而实现对资源的原子操作，保证资源的安全。
</p>
</div>
</div>
<div id="outline-container-sec-4-3-2" class="outline-4">
<h4 id="sec-4-3-2"><span class="section-number-4">4.3.2</span> 排队的实现</h4>
<div class="outline-text-4" id="text-4-3-2">
<p>
那么，排队模型怎么实现呢？就说高速路出口的例子，两车司机同时想跟在一个车后面的时候，大概是通过眼神交流，协商好，谁在
前面谁在后面 。饭店那个例子中，做菜的先后顺序，应该是按照点菜的顺序，先来后到。这其实就是实现排队的两种方法。其一，
就是大家协商；其二就是操作在到达争用之前，本身就是有序的。
</p>

<p>
对应在Java中，协商是怎么实现的呢？线程不可能像人一样有自主思维意识，知道礼让排队。那么线程能怎么判断能不能操作资源呢？
那么，我们可以从资源的角度来看，当资源已经被占用的时候，新来的线程是不用操作资源的，只能等待。资源没有被其他线程占用，
也就是空闲的时候，才能被线程操作。那么线程要获取资源的操作权限的时候，可以先判断资源状态，空闲才能使用资源，使用过程
说要将资源的状态设置为被占用，使用完成之后将资源状态设置为空闲。
</p>

<p>
实际使用过程中，我们不可能说为每个共享的资源去设置一个状态字段，因为这与业务本身是无关的，应该被抽象出来作为一个通用
的逻辑。怎么抽象呢，其实我们就需要一个状态字段，标明对应的资源是被占用还是空闲状态，这个字段可以以任何形式存在，没必
要放在资源对象里面。
</p>

<p>
前面说的是协商实现排队的方式。还有一种方式就是让自然争用者自带顺序，比如按先来后到，比如到达资源争用之前，每个争用者
分配一个序列号，按序列号使用资源。
</p>
</div>
</div>
</div>
<div id="outline-container-sec-4-4" class="outline-3">
<h3 id="sec-4-4"><span class="section-number-3">4.4</span> 从资源的角度解决问题</h3>
<div class="outline-text-3" id="text-4-4">
<p>
从资源的角度来解决资源争用的问题，就是提供足够多的资源，让使用者不去争。不争的还有一种方式就是资源是可被复用的，这相
当于有无限多份资源，是足够多资源的一种特例。
</p>
</div>
<div id="outline-container-sec-4-4-1" class="outline-4">
<h4 id="sec-4-4-1"><span class="section-number-4">4.4.1</span> 不共享资源 New</h4>
<div class="outline-text-4" id="text-4-4-1">
<p>
不共享资源的一种实现方式是来一个争用者就创建一份新在资源给争用者使用，这样就不会跟其他争用者产生竞争关系。
</p>
</div>
</div>
<div id="outline-container-sec-4-4-2" class="outline-4">
<h4 id="sec-4-4-2"><span class="section-number-4">4.4.2</span> 资源不可变 ImmutableData</h4>
<div class="outline-text-4" id="text-4-4-2">
<p>
这是不共享的一种特例，相当于有无限多份资源，每个争用者可以自由使用。
</p>
</div>
</div>
</div>
<div id="outline-container-sec-4-5" class="outline-3">
<h3 id="sec-4-5"><span class="section-number-3">4.5</span> 更细的粒度</h3>
<div class="outline-text-3" id="text-4-5">
</div><div id="outline-container-sec-4-5-1" class="outline-4">
<h4 id="sec-4-5-1"><span class="section-number-4">4.5.1</span> 共享锁与排他锁</h4>
<div class="outline-text-4" id="text-4-5-1">
<p>
对资源的使用有两种情况，一是使用会修改资源，二是使用不修改资源。对于只有不修改资源的这种使用场景，就相当于资源不可变。
但对于有修改资源操作的场景，就要排队了。也就是说修改操作是互斥的，修改操作和不修改操作是互斥的。所以因为怼资源操作的
不同，所以资源占用对应的状态也不相同，
</p>
</div>
</div>
<div id="outline-container-sec-4-5-2" class="outline-4">
<h4 id="sec-4-5-2"><span class="section-number-4">4.5.2</span> MVCC</h4>
<div class="outline-text-4" id="text-4-5-2">
<p>
MVCC是一种结合了资源与排队两个方面的方法实现的争用模型，首先，资源每个版本都一个唯一的序列号，不同版本的序列号是有顺
序的，争用者获取资源的操作之后，得到资源版本号，比如99；当要修改资源的时候，会带着序列号来操作，这样就实现了排队。而
对于不修改资源的操作来说，可以正常获取资源，没有争用。
</p>
</div>
</div>
</div>
</div>
