java/concurrency.html

<div id="outline-container-sec-5-4-3" class="outline-4">
<h4 id="sec-5-4-3"><span class="section-number-4">5.4.3</span> AQS解读</h4>
<div class="outline-text-4" id="text-5-4-3">
<p>
前面我们所讲的，都是一种感性的认知。比如我们说所有的争用操作都会中某个资源状态互斥量上排队，比如我们说sync保证了线程
安全，比如我们说ReadWriteLock实现了读写锁，这些都是感性的认知，我们会理解为这样就安全了。但这些到底是怎么实现呢？下
面我们以AQS为例子，详细说明设计一个锁到底要包含哪些东西，需要哪些支撑，实现哪些功能。
</p>

<p>
<b>一个锁的设计要考虑的包含如下几个方面：</b> <br  />
</p>

<p>
<b>1. 抽象资源状态的标志位</b> 
</p>

<p>
<b>2. 对标志位的原子复合操作</b> 
</p>

<p>
<b>3. 对争用者行为的控制，包括暂停和恢复</b> 
</p>

<p>
<b>4. 对争用者的暂存功能</b>
</p>

<p>
以上四个条件，就是设计一个锁的时候所要考虑的必要条件。将这四个全部实现，我们就可以设计出一个基本的锁来，然后再通过添
加一些其他的属性或操作，进而实现复杂一点的锁。这个复杂不是说分布式锁就复杂了，而是一些锁的其他特性，比如公平非公平，
排他还是共享。
</p>

<p>
AQS的全称叫AbstractQueuedSynchronizer，AQS就通过实现上面三个条件，进而提供了一个基础的锁的功能。AQS是怎么实现上面三
个条件的呢？这要从AQS的基本组成和操作讲起，首先AQS的基本组成包含三部分，一个int类型的state字段-作为抽象资源状态的标
志位；一个CHL队列，用来储存被暂停的线程-实现对争用者行为的暂存功能，方便恢复；还有一个就是系统提供的Unsafe对象，这个对象
主要提供了一种功能，就是对state字段原子复合操作，也就是我们常说的cas，比较成功并设置操作，这个操作由jvm层保证了原子
性。
</p>

<p>
AQS的组成满足了上面的条件1，2和4，那么条件3是怎么实现的呢？JUC使用了JVM提供的LockSupport类来实现3。顾名思义，
LockSupport就提供了锁的基本行为支撑，包括暂停争用者行为和恢复争用者行为。
</p>

<p>
下面我们通过分析JUC中ReentrantLock是怎么实现的，来看看怎么把这四个条件组合在一起就实现一个锁的。要分析一个代码为啥这
么写，要先分析这个代码提供了什么功能。那么ReentrantLock提供了什么功能呢，公平或者非公平的可重入锁。我们这里以公平的
可重入锁来分析功能。公平的意思是线程按先来后到的顺序依次获取、使用和释放锁。可重入的意思是同一个线程在获得锁之后，再
一次运行到获取锁的时候，不会被阻塞，释放的次数和获取的次数一样，才能释放掉锁。最后，它还实现了锁的功能。
</p>

<p>
<b>ReentrantLock有个内部类叫做FairSync，它是AQS的一个子类，我们来梳理一下lock过程：</b>
</p>
</div>
<ol class="org-ol"><li><a id="sec-5-4-3-1" name="sec-5-4-3-1"></a>尝试使用原子操作将抽象标志位（state）的值从0改变为1，这里0表示没有线程占用资源，1表示线程独占资源。<br  /><div class="outline-text-5" id="text-5-4-3-1">
<p>
1). 获取state值，判断是0的话表明锁未被占用，然后利用UnSafe提供的cas操作尝试将state的值设置为1如果设置成功则说明当
   前线程持有了锁。将锁的拥有者设为当前线程，返回成功标志
</p>

<p>
2). 如果state的值不是0，说明锁已经被一个线程持有了，然后判断锁的持有者是不是当前线程，如果是的话将state的值加一，
   实现了线程重入次数的记录，后面释放锁的时候对于重入的线程，重入了几次就要做几次减一操作。返回成功标志
</p>
<div class="org-src-container">

<pre class="src src-java">/**
 * 获取公平锁的方法
  * 1）获取锁数量c
  * 1.1)如果c==0，如果当前线程是等待队列中的头节点，使用CAS将state（锁数量）从0设置为1，如果设置成功，当前线程独占锁--&gt;请求成功
  * 1.2)如果c!=0，判断当前的线程是不是就是当下独占锁的线程，如果是，就将当前的锁数量状态值+1（这也就是可重入锁的名称的来源）--&gt;请求成功
  * 最后，请求失败后，将当前线程链入队尾并挂起，之后等待被唤醒。
  */
 protected final boolean tryAcquire(int acquires) {
     final Thread current = Thread.currentThread();
     int c = getState();
     if (c == 0) {
	 if (isFirst(current) &amp;&amp; compareAndSetState(0, acquires)) {
	     setExclusiveOwnerThread(current);
	     return true;
	 }
     }
     else if (current == getExclusiveOwnerThread()) {
	 int nextc = c + acquires;
	 if (nextc &lt; 0)
	     throw new Error("Maximum lock count exceeded");
	 setState(nextc);
	 return true;
     }
     return false;
 }
</pre>
</div>
</div>
</li>
