java/concurrency.org
****    如果第一步尝试失败，会把当前线程放到CHL队列的尾部（公平锁与非公平锁的区别就在这里），放入尾部的这个操作实际上也是
       对CHL队列尾部资源的争用，这里是也是通过cas操作去实现的

       1). 创建一个新的CHL节点，存放当前线程；通过一次cas操作实现fast-try，就是快速尝试将节点放入到CHL队列尾部
#+begin_src java
/**
 * 将Node节点加入等待队列
 * 1）快速入队，入队成功的话，返回node
 * 2）入队失败的话，使用正常入队
 * 注意：快速入队与正常入队相比，可以发现，正常入队仅仅比快速入队多而一个判断队列是否为空且为空之后的过程
 * @return 返回当前要插入的这个节点，注意不是前一个节点
 */
private Node addWaiter(Node mode) {
   Node node = new Node(Thread.currentThread(), mode);//创建节点
  /*
   * 快速入队
   */
  Node pred = tail;//将尾节点赋给pred
  if (pred != null) {//尾节点不为空
      node.prev = pred;//将尾节点作为创造出来的节点的前一个节点，即将node链接到为节点后
      /**
       * 基于CAS将node设置为尾节点，如果设置失败，说明在当前线程获取尾节点到现在这段过程中已经有其他线程将尾节点给替换过了
       * 注意：假设有链表node1-->node2-->pred（当然是双链表，这里画成双链表才合适）,
       * 通过CAS将pred替换成了node节点，即当下的链表为node1-->node2-->node,
       * 然后根据上边的"node.prev = pred"与下边的"pred.next = node"将pred插入到双链表中去，组成最终的链表如下：
       * node1-->node2-->pred-->node
       * 这样的话，实际上我们发现没有指定node2.next=pred与pred.prev=node2，这是为什么呢？
       * 因为在之前这两句就早就执行好了，即node2.next和pred.prev这连个属性之前就设置好了
       */
      if (compareAndSetTail(pred, node)) {
          pred.next = node;//将node放在尾节点上
          return node;
      }
  }
  enq(node);//正常入队
  return node;
}
#+end_src
       2). 如果fast-try失败，就通过for(;;)循环尝试将节点加入到队列尾部去
#+begin_src java
/**
 * 正常入队
 * @param node
 * @return 之前的尾节点
 */
private Node enq(final Node node) {
    for (;;) {//无限循环，一定要阻塞到入队成功为止
        Node t = tail;//获取尾节点
        if (t == null) { //如果尾节点为null，说明当前等待队列为空
            /*Node h = new Node(); // Dummy header
            h.next = node;
            node.prev = h;
            if (compareAndSetHead(h)) {//根据代码实际上是：compareAndSetHead(null,h)
                tail = node;
                return h;
            }*/
            /*
             * 注意：上边注释掉的这一段代码是jdk1.6.45中的，在后来的版本中，这一段改成了如下这段
             * 基于CAS将新节点（一个dummy节点）设置到头上head去，如果发现内存中的当前值不是null，则说明，在这个过程中，已经有其他线程设置过了。
             * 当成功的将这个dummy节点设置到head节点上去时，我们又将这个head节点设置给了tail节点，即head与tail都是当前这个dummy节点，
             * 之后有新节点入队的话，就插入到该dummy之后
             */
            if (compareAndSetHead(new Node()))
                tail = head;
        } else {//这一块儿的逻辑与快速入队完全相同
            node.prev = t;
            if (compareAndSetTail(t, node)) {//尝试将node节点设为尾节点
                t.next = node;//将node节点设为尾节点
                return t;
            }
        }
    }
}
#+end_src
       3). 入队成功后，有可能前面的节点的线程已经成功释放锁了，这时候刚刚入队的节点就会成为头节点，然后再执行步骤1去尝试
          获取锁，成功则返回
#+begin_src java
final boolean acquireQueued(final Node node, int arg) {
    try {
        boolean interrupted = false;
        /*
         * 无限循环（一直阻塞），直到node的前驱节点p之前的所有节点都执行完毕，p成为了head且node请求成功了
         */
        for (;;) {
            final Node p = node.predecessor();//获取插入节点的前一个节点p
            /*
             * 注意：
             * 1、这个是跳出循环的唯一条件，除非抛异常
             * 2、如果p == head && tryAcquire(arg)第一次循环就成功了，interrupted为false，不需要中断自己
             *         如果p == head && tryAcquire(arg)第一次以后的循环中如果执行了挂起操作后才成功了，interrupted为true，就要中断自己了
             */
            if (p == head && tryAcquire(arg)) {
                setHead(node);//当前节点设置为头节点
                p.next = null; 
                return interrupted;//跳出循环
            }
            if (shouldParkAfterFailedAcquire(p, node) && parkAndCheckInterrupt())
                interrupted = true;//被中断了
        }
    } catch (RuntimeException ex) {
        cancelAcquire(node);
        throw ex;
    }
}
#+end_src
       4). 如果当前节点不是头节点，说明前面节点的线程还没有释放锁，那么就要通过判断当前节点的前一个节点的状态，来决定当
       前节点能不能被阻塞，如果可以利用LockSupport的功能将当前线程阻塞住;否则就把前面节点中，被取消的节点删除掉
#+begin_src java
/**
 * 检测当前节点是否可以被安全的挂起（阻塞）
 * @param pred    当前节点的前驱节点
 * @param node    当前节点
 */
private static boolean shouldParkAfterFailedAcquire(Node pred, Node node) {
    int ws = pred.waitStatus;//获取前驱节点（即当前线程的前一个节点）的等待状态
    if (ws == Node.SIGNAL)//如果前驱节点的等待状态是SIGNAL，表示当前节点将来可以被唤醒，那么当前节点就可以安全的挂起了
        return true;
    /*
     * 1）当ws>0(即CANCELLED==1），前驱节点的线程被取消了，我们会将该节点之前的连续几个被取消的前驱节点从队列中剔除，返回false（即不能挂起）
     * 2）如果ws<=0&&!=SIGNAL,将当前节点的前驱节点的等待状态设为SIGNAL
     */
    if (ws > 0) {
        do {
            /*
             * node.prev = pred = pred.prev;
             * 上边这句代码相当于下边这两句
             * pred = pred.prev;
             * node.prev = pred;
             */
            node.prev = pred = pred.prev;
        } while (pred.waitStatus > 0);
        pred.next = node;
    } else {
        /*
         * 尝试将当前节点的前驱节点的等待状态设为SIGNAL
         * 1/这为什么用CAS，现在已经入队成功了，前驱节点就是pred，除了node外应该没有别的线程在操作这个节点了，那为什么还要用CAS？而不直接赋值呢？
         * （解释：因为pred可以自己将自己的状态改为cancel，也就是pred的状态可能同时会有两条线程（pred和node）去操作）
         * 2/既然前驱节点已经设为SIGNAL了，为什么最后还要返回false
         * （因为CAS可能会失败，这里不管失败与否，都返回false，下一次执行该方法的之后，pred的等待状态就是SIGNAL了）
         */
        compareAndSetWaitStatus(pred, ws, Node.SIGNAL);
    }
    return false;
}
#+end_src
利用LockSupport实现对线程的暂停操作
#+begin_src java
private final boolean parkAndCheckInterrupt() {
    LockSupport.park(this);//挂起当前的线程
    return Thread.interrupted();//如果当前线程已经被中断了，返回true
}
#+end_src

    *讲完加锁操作，我们再来看一下解锁是怎么实现的：*

    1) 其实释放锁的操作就比较简单了，首先判断释放锁的线程是否是持有锁的线程，不是则抛出异常。
    2) 判断释放锁之后，资源状态是不是空闲状态，如果是将锁持有者设置成空，标明没有被占用。并且将CLH队列里，后续节点中第一
       个有效的节点唤醒
    3) 将计算出的资源状态值设置到资源状态标志位

设置资源状态的代码：
#+begin_src java
protected final boolean tryRelease(int releases) {
    int c = getState() - releases;
    if (Thread.currentThread() != getExclusiveOwnerThread())
        throw new IllegalMonitorStateException();
    boolean free = false;
    if (c == 0) {
        free = true;
        setExclusiveOwnerThread(null);
    }
    setState(c);
    return free;
}
#+end_src

唤醒后续节点的代码：
#+begin_src java
private void unparkSuccessor(Node node) {
    /*
     * If status is negative (i.e., possibly needing signal) try
     * to clear in anticipation of signalling. It is OK if this
     * fails or if status is changed by waiting thread.
     */
    int ws = node.waitStatus;
    if (ws < 0)
        compareAndSetWaitStatus(node, ws, 0); 

    /*
     * Thread to unpark is held in successor, which is normally
     * just the next node.  But if cancelled or apparently null,
     * traverse backwards from tail to find the actual
     * non-cancelled successor.
     */
    Node s = node.next;
    if (s == null || s.waitStatus > 0) {
        s = null;
        for (Node t = tail; t != null && t != node; t = t.prev)
            if (t.waitStatus <= 0)
                s = t;
    }
    if (s != null)
        LockSupport.unpark(s.thread);
}
#+end_src

    LockSupport+cas+state+CHL队列构成了Java实现锁的四个基本要素。在其他的系统中，我们想要构建一个锁的时候，也要从这四方
    面考虑，只要满足了这四个条件，就可以去构建自己想要实现的锁。
*** 读写分离
    可重入读写锁的特性就是读读不互斥，读写、写写操作是互斥的。那么跟可重入锁的区别就是纯读操作的时候，是不用排队的。再细
    化下去就是，资源状态不是简单的分为占用和空闲，而是分为排他占用、共享占用和空闲。对资源的操作也分为排他操作和共享操作。
    其中排他操作操作资源的时候要将资源状态设置为排他占用，不允许其他操作类型的操作进入。而共享操作读取资源的时候，资源设
    置为共享占用，允许其他共享操作获取锁，但不允许排他操作获取锁。具体的实现可以参考ReentrantReadWriteLock，就不详细解说
    了。
