java/concurrency.org
* 分布式系统中的资源争用
  在分布式系统中，更涉及到资源争用的问题。适当抽象之后，也符合资源争用模型。分布式系统中所涉及的一致性问题，也可以通过与
  java中类似的方案去解决，比如增加资源，比如排队模型。
  
  分布式系统中，锁的构建也符合之前所说的4个条件。比如我们利用redis提供的原子操作，用一个特定的key抽象要共享的资源，然后
  用key对应的值来抽象资源状态，实现多机对同一资源的安全使用。我们使用zookeeper来保证分布式系统的一致性的时候，也是利用了
  zookeeper提供的原子操作来实现分布式锁或者排队操作的。
  
  redis的server端，对所有的操作，不区分读写，都是按到达顺序一个一个处理的。zookeeper是将读写分离，选定一台机器做master，所有的写
  操作，都由master完成；读操作都从slave机器读数据。

  累了，不详细讲了。
* 学习路线图
| 阶段     | 主要书籍                                                  | 核心知识点                                                                 |
|----------+-----------------------------------------------------------+----------------------------------------------------------------------------|
| 第一阶段 | 《七周七并发模型》、《Java多线程编程实战指南 设计模式篇》 | 主要讲解资源争用模型，有哪些保证资源安全的模型                             |
| 第二阶段 | 《java线程第三版》                                        | Java中线程的概念，实现；线程池是使用                                       |
| 第三阶段 | 《Java并发编程实战》、《java并发编程艺术》等书籍          | 了解Java有哪些实现线程安全的方式，JUC怎么使用，适用什么场景等              |
| 第四阶段 | 《深入理解java内存模型》、《JSR133》                      | 了解java是如何套用资源争用模型的，Java里面的东西怎么跟资源争用模型一一对应 |
| 第五阶段 | 《Java并发编程：设计原则与模式(第二版)》                    | 跟随Doug Lea学习如何设计锁                                                          | 
  
