java/concurrency.html
<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> 分布式系统中的资源争用</h2>
<div class="outline-text-2" id="text-7">
<p>
在分布式系统中，更涉及到资源争用的问题。适当抽象之后，也符合资源争用模型。分布式系统中所涉及的一致性问题，也可以通过与
java中类似的方案去解决，比如增加资源，比如排队模型。
</p>

<p>
分布式系统中，锁的构建也符合之前所说的4个条件。比如我们利用redis提供的原子操作，用一个特定的key抽象要共享的资源，然后
用key对应的值来抽象资源状态，实现多机对同一资源的安全使用。我们使用zookeeper来保证分布式系统的一致性的时候，也是利用了
zookeeper提供的原子操作来实现分布式锁或者排队操作的。
</p>

<p>
redis的server端，对所有的操作，不区分读写，都是按到达顺序一个一个处理的。zookeeper是将读写分离，选定一台机器做master，所有的写
操作，都由master完成；读操作都从slave机器读数据。
</p>

<p>
累了，不详细讲了。
</p>
</div>
</div>
<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> 学习路线图</h2>
<div class="outline-text-2" id="text-8">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">阶段</th>
<th scope="col" class="left">主要书籍</th>
<th scope="col" class="left">核心知识点</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">第一阶段</td>
<td class="left">《七周七并发模型》、《Java多线程编程实战指南 设计模式篇》</td>
<td class="left">主要讲解资源争用模型，有哪些保证资源安全的模型</td>
</tr>

<tr>
<td class="left">第二阶段</td>
<td class="left">《java线程第三版》</td>
<td class="left">Java中线程的概念，实现；线程池是使用</td>
</tr>

<tr>
<td class="left">第三阶段</td>
<td class="left">《Java并发编程实战》、《java并发编程艺术》等书籍</td>
<td class="left">了解Java有哪些实现线程安全的方式，JUC怎么使用，适用什么场景等</td>
</tr>

<tr>
<td class="left">第四阶段</td>
<td class="left">《深入理解java内存模型》、《JSR133》</td>
<td class="left">了解java是如何套用资源争用模型的，Java里面的东西怎么跟资源争用模型一一对应</td>
</tr>

<tr>
<td class="left">第五阶段</td>
<td class="left">《Java并发编程：设计原则与模式(第二版)》</td>
<td class="left">跟随Doug Lea学习如何设计锁</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: 王月阳</p>
<p class="date">Created: 2017-10-11 周三 15:39</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
